[
{
"style": "Sriracha",
"desc": "Sweeter than most hot sauces, a good sriracha has a lot of funk. This sauce won't run off your food, it's thick enough to stay on top of your eggs. Srirachas are always blended smooth, and they always  include garlic."
},
{
"style": "Louisiana",
"desc": "A vinegar-forward sauce, these are the classic hot sauce of the American South. People sometimes also call these 'Cajon' hot sauces."
},
{
"style": "Picante",
"desc": "These Mexican-style hot sauces have a similar thin consistency to their Louisana-style sauce from just North of the border. But unlike Louisana sauces they have little to no vinegar."
},
{
"style": "Sambal Oelek",
"desc": "A wonderful simple Indonesian hot sauce; very chunky, mostly peppers, with a little dash of salt and maybe a little vinegar."
},
{
"style": "Chili-Garlic",
"desc": "Like Sriracha, these sauces are thick, but they have more garlic and less sugar/sweetness than Sriracha sauces. And they are frequently less well-blended and chunkier."
},
{
"style": "Gochujang",
"desc": "Hailing from Korea, these sauces are thick, red pastes that frequently include rice, sugar, and soybeans. These are more frequently used in cooking a sauce than as a sauce straight out of the bottle."
},
{
"style": "Harissa",
"desc": "From North Africa, Harissa is always a thick paste. It is an oil-based sauce, usually olive oil. And it always has a blend of spices, frequently cumin and corriander."
},
{
"style": "Akabanga Oil",
"desc": "This is a popular table condiment in Rwanda. Mostly vegetable oil by volume, these sauce frequently have enough Scotch Bonnets and Habaneros to really pack a punch. Akabanga oil is a great way to add some variety to your hot sauce arsenal."
},
{
"style": "Chili Oil",
"desc": "There are a lot of different kinds of chili oils out there, from mostly oil like an Akabanga, to mostly dried peppers in oil like the famous Laoganma from China."
},
{
"style": "New Mexico",
"desc": "The classic 'green chile' and 'red chile' sauces from New Mexico tend to be thick and not complete blended. They always have a full flavor profile in the background, made of things like onions, garlic, and chicken stock."
},
{
"style": "Super Hot",
"desc": "Anything where heat is more important than flavor. These are a very modern style. Broadly, anything over ~500,000 SHU. But that number is arbitrary, so let's not get hung up on it."
},
{
"style": "Craft",
"desc": "The infinite variety of everything else. The craft hot sauce movement has people all over the world playing around with hot peppers and making sauces."
}
]
